; domain
(define (domain moving)
    (:requirements :typing)
    (:types 
        location truck - object
    )
    (:predicates
        (eastof ?obj1 - object ?obj2 - object)
        (westof ?obj1 - object ?obj2 - object)
        (southof ?obj1 - object ?obj2 - object)
        (northof ?obj1 - object ?obj2 - object)
        (faceeast ?t - truck)
        (facewest ?t - truck)
        (facesouth ?t - truck)
        (facenorth ?t - truck)
        (at ?t - truck ?loc - location)
        (empty ?loc - location)
    )
    (:action move-east
        :parameters     (?t - truck ?lf - location ?lt - location)
        :precondition   (and (at ?t ?lf) (faceeast ?t) (eastof ?lt ?lf) (empty ?lt))
        :effect         (and (not (at ?t ?lf)) (empty ?lf) (faceeast ?t) (not (empty ?lt)) (at ?t ?lt))
    )
    (:action move-west
        :parameters     (?t - truck ?lf - location ?lt - location)
        :precondition   (and (at ?t ?lf) (facewest ?t) (westof ?lt ?lf) (empty ?lt))
        :effect         (and (not (at ?t ?lf)) (empty ?lf) (facewest ?t) (not (empty ?lt)) (at ?t ?lt))
    )
    (:action move-south
        :parameters     (?t - truck ?lf - location ?lt - location)
        :precondition   (and (at ?t ?lf) (facesouth ?t) (southof ?lt ?lf) (empty ?lt))
        :effect         (and (not (at ?t ?lf)) (empty ?lf) (facesouth ?t) (not (empty ?lt)) (at ?t ?lt))
    )
    (:action move-north
        :parameters     (?t - truck ?lf - location ?lt - location)
        :precondition   (and (at ?t ?lf) (facenorth ?t) (northof ?lt ?lf) (empty ?lt))
        :effect         (and (not (at ?t ?lf)) (empty ?lf) (facenorth ?t) (not (empty ?lt)) (at ?t ?lt))
    )
    (:action rotate-east-south
        :parameters     (?t - truck)
        :precondition   (and (faceeast ?t))
        :effect         (and (facesouth ?t) (not (faceeast ?t)))
    )
    (:action rotate-south-west
        :parameters     (?t - truck)
        :precondition   (and (facesouth ?t))
        :effect         (and (facewest ?t) (not (facesouth ?t)))
    )
    (:action rotate-west-north
        :parameters     (?t - truck)
        :precondition   (and (facewest ?t))
        :effect         (and (facenorth ?t) (not (facewest ?t)))
    )
    (:action rotate-north-east
        :parameters     (?t - truck)
        :precondition   (and (facenorth ?t))
        :effect         (and (faceeast ?t) (not (facenorth ?t)))
    )
    (:action rotate-east-north
        :parameters     (?t - truck)
        :precondition   (and (faceeast ?t))
        :effect         (and (facenorth ?t) (not (faceeast ?t)))
    )
    (:action rotate-north-west
        :parameters     (?t - truck)
        :precondition   (and (facenorth ?t))
        :effect         (and (facewest ?t) (not (facenorth ?t)))
    )
    (:action rotate-west-south
        :parameters     (?t - truck)
        :precondition   (and (facewest ?t))
        :effect         (and (facesouth ?t) (not (facewest ?t)))
    )
    (:action rotate-south-east
        :parameters     (?t - truck)
        :precondition   (and (facesouth ?t))
        :effect         (and (faceeast ?t) (not (facesouth ?t)))
    )
    
)

; problem
(define (problem moving1)
    (:domain moving)
    (:objects
        loc00 - location
        loc01 - location
        loc02 - location
        loc10 - location
        loc11 - location
        loc12 - location
        loc20 - location
        loc21 - location
        loc22 - location
        tru1 - truck
        tru2 - truck
        tru3 - truck
    )
    (:init
        (eastof loc01 loc00)
        (eastof loc02 loc01)
        (eastof loc11 loc10)
        (eastof loc12 loc11)
        (eastof loc21 loc20)
        (eastof loc22 loc21)
        (westof loc01 loc02)
        (westof loc00 loc01)
        (westof loc11 loc12)
        (westof loc10 loc11)
        (westof loc21 loc22)
        (westof loc20 loc21)
        (southof loc10 loc00)
        (southof loc20 loc10)
        (southof loc11 loc01)
        (southof loc21 loc11)
        (southof loc12 loc02)
        (southof loc22 loc12)
        (northof loc10 loc20)
        (northof loc00 loc10)
        (northof loc11 loc21)
        (northof loc01 loc11)
        (northof loc12 loc22)
        (northof loc02 loc12)
        (at tru1 loc00)
        (at tru2 loc01)
        (at tru3 loc02)
        (empty loc10)
        (empty loc11)
        (empty loc12)
        (empty loc20)
        (empty loc21)
        (empty loc22)
        (faceeast tru1)
        (facenorth tru2)
        (faceeast tru3)
    )
    (:goal
        (and
            (at tru1 loc11)
            (at tru2 loc21)
            (at tru3 loc20)
        )
    )
)

; plan
1. (rotate-north-west tru2)
   deleted: (facenorth tru2)
   added: (facewest tru2)
   goals met: 0 of 3
2. (rotate-west-south tru2)
   deleted: (facewest tru2)
   added: (facesouth tru2)
   goals met: 0 of 3
3. (move-south tru2 loc01 loc11)
   deleted: (at tru2 loc01) (empty loc11)
   added: (empty loc01) (at tru2 loc11)
   goals met: 0 of 3
4. (move-south tru2 loc11 loc21)
   deleted: (at tru2 loc11) (empty loc21)
   added: (empty loc11) (at tru2 loc21)
   goals met: 1 of 3
5. (move-east tru1 loc00 loc01)
   deleted: (at tru1 loc00) (empty loc01)
   added: (empty loc00) (at tru1 loc01)
   goals met: 1 of 3
6. (rotate-east-south tru1)
   deleted: (faceeast tru1)
   added: (facesouth tru1)
   goals met: 1 of 3
7. (move-south tru1 loc01 loc11)
   deleted: (at tru1 loc01) (empty loc11)
   added: (empty loc01) (at tru1 loc11)
   goals met: 2 of 3
8. (rotate-east-north tru3)
   deleted: (faceeast tru3)
   added: (facenorth tru3)
   goals met: 2 of 3
9. (rotate-north-west tru3)
   deleted: (facenorth tru3)
   added: (facewest tru3)
   goals met: 2 of 3
10. (move-west tru3 loc02 loc01)
   deleted: (at tru3 loc02) (empty loc01)
   added: (empty loc02) (at tru3 loc01)
   goals met: 2 of 3
11. (move-west tru3 loc01 loc00)
   deleted: (at tru3 loc01) (empty loc00)
   added: (empty loc01) (at tru3 loc00)
   goals met: 2 of 3
12. (rotate-west-south tru3)
   deleted: (facewest tru3)
   added: (facesouth tru3)
   goals met: 2 of 3
13. (move-south tru3 loc00 loc10)
   deleted: (at tru3 loc00) (empty loc10)
   added: (empty loc00) (at tru3 loc10)
   goals met: 2 of 3
14. (move-south tru3 loc10 loc20)
   deleted: (at tru3 loc10) (empty loc20)
   added: (empty loc10) (at tru3 loc20)
   goals met: 3 of 3
